#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.5.221");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();

	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ИзменениеШтатногоРасписания"); 		  // тут где будет печатка в каком доке или справочнике
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	
	ПараметрыРегистрации.Версия = "21.12.16";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Ведомость замены"; // Синоним
	НоваяКоманда.Идентификатор = "ВедомостьЗамены"; //Имя для разраба 
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(Истина, Истина);
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	
	Возврат ПараметрыРегистрации;                                       
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()
    
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, 
						  Представление, 
						  Идентификатор, 
						  Использование = "ОткрытиеФормы", 
						  ПоказыватьОповещение = Ложь, 
						  Модификатор = "ПечатьMXL")
    
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры 

#КонецОбласти

#Область Печать
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт   

	//Попытка
		Если МассивОбъектов.Количество()>1 или Не ЗначениеЗаполнено(ПараметрыСеанса.ГХУ_АдресВременногоХранилищаДляПечати) тогда
			ТекстСообщения = НСтр("ru = 'Данная печатная форма не предназначена для печати из формы списка!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ТабличныйДокумент = ПечатьМассиваОбъектов(МассивОбъектов);
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ВедомостьЗамены",
			"Ведомость замены",
			ТабличныйДокумент
			);
		КонецЕсли; 
	//Исключение
	//	ТекстСообщения = НСтр("ru = 'Данная печатная форма не предназначена для печати из формы списка!'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	//КонецПопытки; 
	
КонецПроцедуры 

Функция ПечатьМассиваОбъектов(МассивОбъектов)
	
	ТабДок = Новый ТабличныйДокумент;
	Для каждого Ссылка из МассивОбъектов Цикл
		ПечатьОбъекта(ТабДок, Ссылка);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.ПолеСверху = 20;
	ТабДок.ПолеСнизу  = 20;
	ТабДок.ПолеСлева  = 30;
	ТабДок.ПолеСправа = 10;
	ТабДок.АвтоМасштаб = Ложь;
	
	Возврат ТабДок;
	
КонецФункции
#КонецОбласти 


Процедура ПечатьОбъекта(ТабДок, Ссылка)
	
	//НомерТЧ = 0;
	
	// На клиенте
	// ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	//ИмяФормы = Ссылка.Метаданные().ПолноеИмя() + ".ФормаДокумента"; // или через Метаданные()
	//ФормаДокумента = ПолучитьФорму(ИмяФормы, ПараметрыФормы);
	//Сообщить(Строка(ИмяФормы));
	//Сообщить(Строка(ФормаДокумента));
	//ОбъектДанных = ДанныеФормыВЗначение(ФормаДокумента.Объект, Тип("ДокументОбъект.ИзменениеШтатногоРасписания"));
	
	АдресДанных = ПараметрыСеанса.ГХУ_АдресВременногоХранилищаДляПечати;
	
	Если ЗначениеЗаполнено(АдресДанных) Тогда
		// 2. Восстанавливаем наш массив данных
		ТаблицаЗначенийСКлиента = ПолучитьИзВременногоХранилища(АдресДанных);
		
		// Очищаем параметр сеанса за собой, чтобы не использовать старые данные при следующей печати
		ПараметрыСеанса.ГХУ_АдресВременногоХранилищаДляПечати = ""; 
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	МассивОбластей = новый Массив;
	
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	//Шапка.Параметры.Организация = Врег(Ссылка.Организация.НаименованиеПолное);
	Шапка.Параметры.Организация ="ПО ГОСУДАРСТВЕННОМУ УЧРЕЖДЕНИЮ «САНАТОРИЙ «ЮНОСТЬ»";
	Шапка.Параметры.Год = Формат(Ссылка.ДатаВступленияВСилу,"ДФ=гггг");

	ТаблицаПозиций = ТаблицаЗначенийСКлиента; 
	ВводимыеПозиции = новый ТаблицаЗначений;
	ВводимыеПозиции.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ВводимыеПозиции.Колонки.Добавить("Должность",Новый ОписаниеТипов("СправочникСсылка.Должности")); 
	ВводимыеПозиции.Колонки.Добавить("Позиция",Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ВводимыеПозиции.Колонки.Добавить("КоличествоСтавок",Новый ОписаниеТипов("Число"));
	ВводимыеПозиции.Колонки.Добавить("ГХУ_НомерСвязи",Новый ОписаниеТипов("Число"));
	ВводимыеПозиции.Колонки.Добавить("ГХУ_ДатаПо",Новый ОписаниеТипов("Дата"));
	ВводимыеПозиции.Колонки.Добавить("РазрядКатегория",Новый ОписаниеТипов("СправочникСсылка.РазрядыКатегорииДолжностей"));
	ВводимыеПозиции.Колонки.Добавить("Действие",Новый ОписаниеТипов("ПеречислениеСсылка.ДействияСПозициямиШтатногоРасписания"));
	ВводимыеПозиции.Колонки.Добавить("ТекущееКоличествоСтавок",Новый ОписаниеТипов("Число"));
	ВводимыеПозиции.Колонки.Добавить("ОкладТариф",Новый ОписаниеТипов("Число"));
	ВводимыеПозиции.Колонки.Добавить("ТекущийФОТ",Новый ОписаниеТипов("Число"));
	ВводимыеПозиции.Колонки.Добавить("ФОТ",Новый ОписаниеТипов("Число"));
	
	ВыводимыеПозиции = новый ТаблицаЗначений;
	ВыводимыеПозиции.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ВыводимыеПозиции.Колонки.Добавить("Должность",Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ВыводимыеПозиции.Колонки.Добавить("Позиция",Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ВыводимыеПозиции.Колонки.Добавить("КоличествоСтавок",Новый ОписаниеТипов("Число"));
	ВыводимыеПозиции.Колонки.Добавить("ГХУ_НомерСвязи",Новый ОписаниеТипов("Число"));
	ВыводимыеПозиции.Колонки.Добавить("ГХУ_ДатаПо",Новый ОписаниеТипов("Дата"));
	ВыводимыеПозиции.Колонки.Добавить("РазрядКатегория",Новый ОписаниеТипов("СправочникСсылка.РазрядыКатегорииДолжностей"));
	ВыводимыеПозиции.Колонки.Добавить("Действие",Новый ОписаниеТипов("ПеречислениеСсылка.ДействияСПозициямиШтатногоРасписания"));
	ВыводимыеПозиции.Колонки.Добавить("ТекущееКоличествоСтавок",Новый ОписаниеТипов("Число"));
	ВыводимыеПозиции.Колонки.Добавить("ОкладТариф",Новый ОписаниеТипов("Число"));
	ВыводимыеПозиции.Колонки.Добавить("ТекущийФОТ",Новый ОписаниеТипов("Число"));
	ВыводимыеПозиции.Колонки.Добавить("ФОТ",Новый ОписаниеТипов("Число"));
	
	Для каждого СтрокаПозиции из ТаблицаПозиций Цикл
		Если СтрокаПозиции.Действие = Перечисления.ДействияСПозициямиШтатногоРасписания.СоздатьНовуюПозицию 
			Или СтрокаПозиции.КоличествоСтавок > СтрокаПозиции.ТекущееКоличествоСтавок Тогда
			ВводимаяПозиция = ВводимыеПозиции.Добавить();
			ЗаполнитьЗначенияСвойств(ВводимаяПозиция,СтрокаПозиции);
			ВводимаяПозиция.КоличествоСтавок = ВводимаяПозиция.КоличествоСтавок - ВводимаяПозиция.ТекущееКоличествоСтавок;
		ИначеЕсли СтрокаПозиции.Действие = Перечисления.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию 
			Или СтрокаПозиции.КоличествоСтавок < СтрокаПозиции.ТекущееКоличествоСтавок Тогда
			ВыводимаяПозиция = ВыводимыеПозиции.Добавить();
			ЗаполнитьЗначенияСвойств(ВыводимаяПозиция,СтрокаПозиции);
			Если СтрокаПозиции.Действие <> Перечисления.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию Тогда
				ВыводимаяПозиция.КоличествоСтавок = ВыводимаяПозиция.ТекущееКоличествоСтавок - ВыводимаяПозиция.КоличествоСтавок;
			Иначе
				ВыводимаяПозиция.ОкладТариф = ПолучитьОкладЗакрываемойПозиции(СтрокаПозиции,Ссылка.ДатаВступленияВСилу-1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести (Шапка);
	
	ВыводимыеПозиции.Сортировать("ГХУ_ДатаПо Возр"); 
	
	ОбластьПериод = Макет.ПолучитьОбласть("Период");
	ТекущийПериод = 0;
	ИтогСтавки = 0;
	ИтогСтавки1 = 0;
	ИтогОклад = 0;
	ИтогОклад1 = 0;
	
	ОбщийИтогСтавки = 0;
	ОбщийИтогСтавки1 = 0;
	ОбщийИтогОклад = 0;
	ОбщийИтогОклад1 = 0;
	
	НомерПП = 1;
	Для каждого Строка из ВыводимыеПозиции Цикл
		Если ТекущийПериод <> Строка.ГХУ_ДатаПо Тогда
			Если ЗначениеЗаполнено(Строка.ГХУ_ДатаПо) Тогда
				ОбластьПериод.Параметры.Период = ""+Формат(Ссылка.ДатаВступленияВСилу,"ДФ='""«""дд""»"" ММММ гггг ""года""'")+" по "+Формат(Строка.ГХУ_ДатаПо,"ДФ='""«""дд""»"" ММММ гггг ""года""'");	
	        Иначе
	            ОбластьПериод.Параметры.Период =""+Формат(Ссылка.ДатаВступленияВСилу,"ДФ='""«""дд""»"" ММММ гггг ""года""'");
			КонецЕсли;
			ОбластьИтогПериода = Макет.ПолучитьОбласть("Итог");
			ОбластьИтогПериода.Параметры.ИтогоСтавокСтарых = ИтогСтавки;
			ОбластьИтогПериода.Параметры.ИтогоСтавокНовых = ИтогСтавки1;
			ОбластьИтогПериода.Параметры.ИтогоОкладСтарый = ИтогОклад;
			ОбластьИтогПериода.Параметры.ИтогоОкладНовый = ИтогОклад1;
			
			ОбщийИтогСтавки = ОбщийИтогСтавки + ИтогСтавки;
			ОбщийИтогСтавки1 = ОбщийИтогСтавки1 + ИтогСтавки1;
			ОбщийИтогОклад = ОбщийИтогОклад + ИтогОклад;
			ОбщийИтогОклад1 = ОбщийИтогОклад1 + ИтогОклад1;
	
			ИтогСтавки = 0;
			ИтогСтавки1 = 0;
			ИтогОклад = 0;
			ИтогОклад1 = 0;
			Если ТекущийПериод <> 0 Тогда
				Табдок.Вывести(ОбластьИтогПериода);
			КонецЕсли;
			Табдок.Вывести(ОбластьПериод);
			ТекущийПериод = Строка.ГХУ_ДатаПо; 
		КонецЕсли;     
		Отбор = новый Структура("ГХУ_НомерСвязи",Строка.ГХУ_НомерСвязи);
		НайденныеСтроки = ВводимыеПозиции.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()<2 Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка3");
		Иначе
			Если НайденныеСтроки[0].РазрядКатегория = НайденныеСтроки[1].РазрядКатегория Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
			КонецЕсли;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Пункт = НомерПП;
		ОбластьСтрока.Параметры.Подразделение = Строка.Подразделение.Наименование;
		//Если ЗначениеЗаполнено(Строка.ГХУ_ДатаПо) Тогда
		//	ОбластьСтрока.Параметры.Должность = Строка.Должность.Наименование + " (сезон)";
		//Иначе
		//	ОбластьСтрока.Параметры.Должность = Строка.Должность.Наименование;
		//КонецЕсли;
		
		ОбластьСтрока.Параметры.Должность = Строка.Должность.Наименование + ПолучитьНаименованиеРазряда(Строка.РазрядКатегория);
		Если ЗначениеЗаполнено(Строка.Позиция.Примечание) Тогда
			ОбластьСтрока.Параметры.Должность = ОбластьСтрока.Параметры.Должность + Символы.ПС + "(" + Строка.Позиция.Примечание+")";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Подразделение.Родитель) Тогда
			Если СтрНайти(Строка.Подразделение.Родитель.Наименование,"Силичи")>0 Тогда 
				ОбластьСтрока.Параметры.ОбособленноеПодразделение = "РГЦ "+Строка.Подразделение.Родитель.Наименование+Символы.ПС;
			ИначеЕсли СтрНайти(Строка.Подразделение.Родитель.Наименование,"Крыжовка")>0 Тогда
				ОбластьСтрока.Параметры.ОбособленноеПодразделение = "ОРБ "+Строка.Подразделение.Родитель.Наименование+Символы.ПС;
			Иначе
				//ОбластьСтрока.Параметры.ОбособленноеПодразделение = Строка.Подразделение.Родитель.Наименование+Символы.ПС;
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоСтавок = Строка.КоличествоСтавок;
		ОбластьСтрока.Параметры.Оклад = ОКР(Строка.ОкладТариф * Строка.КоличествоСтавок,2);
		ИтогСтавки = ИтогСтавки + Строка.КоличествоСтавок; 
		ИтогОклад = ИтогОклад + ОКР(Строка.ОкладТариф * Строка.КоличествоСтавок,2);
		Индекс = 1;
		Для Каждого НоваяСтрока из НайденныеСтроки Цикл
			ОбластьСтрока.Параметры["Подразделение"+Индекс] = НоваяСтрока.Подразделение.Наименование;
			ОбластьСтрока.Параметры["Должность"+Индекс] = НоваяСтрока.Должность.Наименование + ПолучитьНаименованиеРазряда(НоваяСтрока.РазрядКатегория);
			Если ЗначениеЗаполнено(НоваяСтрока.Позиция.Примечание) Тогда
				ОбластьСтрока.Параметры["Должность"+Индекс] = ОбластьСтрока.Параметры["Должность"+Индекс] + Символы.ПС + "(" + НоваяСтрока.Позиция.Примечание+")";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Подразделение.Родитель) Тогда
				Если СтрНайти(НоваяСтрока.Подразделение.Родитель.Наименование,"Силичи")>0 Тогда 
				ОбластьСтрока.Параметры["ОбособленноеПодразделение"+Индекс] = "РГЦ "+НоваяСтрока.Подразделение.Родитель.Наименование+Символы.ПС;
				ИначеЕсли СтрНайти(Строка.Подразделение.Родитель.Наименование,"Крыжовка")>0 Тогда
				ОбластьСтрока.Параметры["ОбособленноеПодразделение"+Индекс] = "ОРБ "+НоваяСтрока.Подразделение.Родитель.Наименование+Символы.ПС;
				Иначе
				//ОбластьСтрока.Параметры.ОбособленноеПодразделение = Строка.Подразделение.Родитель.Наименование+Символы.ПС;
				КонецЕсли;
				//ОбластьСтрока.Параметры["ОбособленноеПодразделение"+Индекс] = "РГЦ "+НоваяСтрока.Подразделение.Родитель.Наименование+Символы.ПС;
			КонецЕсли;
			
			ОбластьСтрока.Параметры["КоличествоСтавок"+Индекс] = НоваяСтрока.КоличествоСтавок;
			ОбластьСтрока.Параметры["Оклад"+Индекс] = ОКР(НоваяСтрока.ОкладТариф * НоваяСтрока.КоличествоСтавок,2);
			Индекс = Индекс+1;
			ИтогСтавки1 = ИтогСтавки1 + НоваяСтрока.КоличествоСтавок; 
			ИтогОклад1 = ИтогОклад1 + ОКР(НоваяСтрока.ОкладТариф * НоваяСтрока.КоличествоСтавок,2);
		КонецЦикла;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтогПериода = Макет.ПолучитьОбласть("Итог");
	ОбластьИтогПериода.Параметры.ИтогоСтавокСтарых = ИтогСтавки;
	ОбластьИтогПериода.Параметры.ИтогоСтавокНовых = ИтогСтавки1;
	ОбластьИтогПериода.Параметры.ИтогоОкладСтарый = ИтогОклад;
	ОбластьИтогПериода.Параметры.ИтогоОкладНовый = ИтогОклад1;
	Табдок.Вывести(ОбластьИтогПериода);
	ОбщийИтогСтавки = ОбщийИтогСтавки + ИтогСтавки;
	ОбщийИтогСтавки1 = ОбщийИтогСтавки1 + ИтогСтавки1;
	ОбщийИтогОклад = ОбщийИтогОклад + ИтогОклад;
	ОбщийИтогОклад1 = ОбщийИтогОклад1 + ИтогОклад1;
	
	ОбластьОбщийИтогПериода = Макет.ПолучитьОбласть("ИтогОбщий");
	ОбластьОбщийИтогПериода.Параметры.ВсегоСтавокСтарых = ОбщийИтогСтавки;
	ОбластьОбщийИтогПериода.Параметры.ВсегоСтавокНовых = ОбщийИтогСтавки1;
	ОбластьОбщийИтогПериода.Параметры.ВсегоОкладСтарый = ОбщийИтогОклад;
	ОбластьОбщийИтогПериода.Параметры.ВсегоОкладНовый = ОбщийИтогОклад1;
	Табдок.Вывести(ОбластьОбщийИтогПериода);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подписи");
	
	ЗапросОтветственные = Новый Запрос;
	ЗапросОтветственные.Текст = "ВЫБРАТЬ
	                            |	СведенияОбОтветственныхЛицахСрезПоследних.РуководительПЭО КАК РуководительПЭО,
	                            |	СведенияОбОтветственныхЛицахСрезПоследних.ГлавныйБухгалтер КАК ГлавныйБухгалтер
	                            |ИЗ
	                            |	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&Период, Организация = &Организация) КАК СведенияОбОтветственныхЛицахСрезПоследних";
	ЗапросОтветственные.УстановитьПараметр("Период",Ссылка.ДатаВступленияВСилу);
	ЗапросОтветственные.УстановитьПараметр("Организация", Ссылка.Организация);
	РезультатЗапроса = ЗапросОтветственные.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ОбластьПодвал.Параметры.ГлавныйБухгалтер = ИнициалыФамилия(РезультатЗапроса.ГлавныйБухгалтер.ФИО); 
		ОбластьПодвал.Параметры.НачальникПЭО = ИнициалыФамилия(РезультатЗапроса.РуководительПЭО.ФИО);
	КонецЕсли;
	ОбластьПодвал.Параметры.Исполнитель = ИнициалыФамилия(Ссылка.Ответственный.ФизическоеЛицо.ФИО);
	Табдок.Вывести(ОбластьПодвал);
КонецПроцедуры     

Функция ПолучитьНаименованиеРазряда(Разряд)
	Если ЗначениеЗаполнено(Разряд) Тогда
		НаименованиеРазряда = Разряд.РазрядЕТС.Наименование;
		ЧастиНаименования = СтрРазделить(НаименованиеРазряда," ");
		НомерРазряда = ЧастиНаименования[0];
		Если СтрНайти(НаименованиеРазряда, "б/к")>0 Тогда
			Возврат "";
		ИначеЕсли СтрНайти(НаименованиеРазряда, "РР")>0 Тогда
			Возврат " "+НомерРазряда+" разряда";
		ИначеЕсли СтрНайти(НаименованиеРазряда, "ТР")>0 Тогда
			Если СтрНайти(НаименованиеРазряда, "высшая")>0 Тогда
				Возврат " высшей категории";
			ИначеЕсли СтрНайти(НаименованиеРазряда, "1 кат.")>0 Тогда
				Возврат  " 1 категории";
			ИначеЕсли СтрНайти(НаименованиеРазряда, "2 кат.")>0 Тогда
				Возврат  " 2 категории";
			КонецЕсли;
		КонецЕсли;
		                         
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


Функция ДваНуляПослеЗапятой(Число)
	
	ЧислоЦелое = Ложь;
	Строка="";
	Деление = Число/Число;
	
	Если Деление = 1 тогда
		ЧислоЦелое = Истина;
	КонецЕсли;
	
	Если ЧислоЦелое тогда 
		Строка = ""+Число+".00";
	Иначе
		Строка = ""+Число;
	КонецЕсли;

	Возврат Строка;
КонецФункции


Функция ИнициалыФамилия(Знач ФамилияИмяОтчество) Экспорт
	
	Если ТипЗнч(ФамилияИмяОтчество) = Тип("Строка") Тогда
		ФамилияИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФамилияИмяОтчество);
	КонецЕсли;
	
	Фамилия = ФамилияИмяОтчество.Фамилия;
	Имя = ФамилияИмяОтчество.Имя;
	Отчество = ФамилияИмяОтчество.Отчество;
	
	Если ПустаяСтрока(Имя) Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Если ПустаяСтрока(Отчество) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2.", Фамилия, Лев(Имя, 1));
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%2.%3. %1", Фамилия, Лев(Имя, 1), Лев(Отчество, 1));
	
КонецФункции

Функция ПолучитьОкладЗакрываемойПозиции(СтрокаПозиции, Дата)
	ДанныеПозиции = УправлениеШтатнымРасписанием.ДанныеПозицииШтатногоРасписания(СтрокаПозиции.Позиция,Дата);
	Возврат ДанныеПозиции.ОкладТариф;
КонецФункции
